

# Определение персонажей игры.
define ded = Character('Дед Захар', color="#00b9d2")
define gg = Character("Матвей", color="#0526ab")
define fm = Character("Рыбак", color="#0526ab")

image bg bus_window_factory = "bus_window_factory.png"
image bg bus_window_village = "bus_window_village.png"
image bg bus_inside = "bus_inside.png"
image bg bus_stop = "bus_stop.png"
image bg black_bg = "black_bg.png"
image bg forest_trail = "forest_trail.png"
image bg lake = "lake.png"
image bg lake_fire = "lake_fire.png"
image bg school = "school.png"
image bg fishing_camp = "fishing_camp.png"
image bg farm = "farm.png"
image bg playground = "playground.png"
image bg house_outside = "house_outside.png"
image bg garden = "garden.png"
image bg behind_house = "behind_house.png"

# Вместо использования оператора image можете просто
# складывать все ваши файлы изображений в папку images.
# Например, сцену bg room можно вызвать файлом "bg room.png",
# а eileen happy — "eileen happy.webp", и тогда они появятся в игре.

# Игра начинается здесь:
label start:
    stop music
    play sound "bus_long.ogg"
    scene bus_window_factory 
    "В окне показались трубы заводов - угрюмая, привычная реальность подоплёкой несостоявшейся молодежи и сотен коммерсантов"
    
    show gg
    gg "за час уже добрался до промзоны - совсем скоро я наконец покину Казань - город, в котором я пытался начать лучшую жизнь …"

    play sound "bus.ogg"

    scene bus_inside

    gg "Надеюсь меня никто не заметил"
    
    hide gg
    "Наконец покинув город, Матвей смог расслабиться и незаметно для себя задремал"

    scene black_bg

    ## Звук удара еблом
    
    show gg
    gg "Ай! Какого…"


    scene bus_inside

    gg "Точно, я же уехал с города… Главное отсидеться и начну новую жизнь"
    
    hide gg
    "За окном начали мелькать деревья загараживающие солнце, которые то и дело слепили из-за листвы. Качество дороги снижалось по мере продвижения к месту назначения…"    
    
    show gg
    gg "Надеюсь Ринат не догадается что это я украл деньги. Подозрительно конечно, что я заранее предупредил о том что уеду в другой город, но у них были большие надежды на меня, не скоро просекут фишку…"


    scene bus_window_village
    
    
    hide gg
    "За горизонтом виднеется поворот, пункт назначения близится"

    show gg
    gg "Опять со стариком ютится, от одной мысли об этом угрюмом хрыче тошно. Если б не отец… Сейчас бы жил как все."
    

    ## Звук торможения автобуса
    
    hide gg
    scene black_bg

    # Звуки шагов и уезжающего автобуса
    
    show gg
    gg "ну здравствуй, Епштейновка"

 
    scene bus_stop
 
    # Крутая музыка на фоне из 2006

    hide gg
    "Матвей слегка потянулся, когда автобус стало совсем не видно за горизонтом поднял свою сумку с земли и пошёл по с детства знакомой дороге."
    "Солнечный свет слепил глаза, на улице было жарко и душно из-за влаги, приносимой легким ветром с местной маленькой речушки по мере того, как он спускался вниз - к деревне"

    ## Картинку с дубом вставьте
    
    show gg
    gg " Аня… Да, местные мальчишки любили над нами подшучивать, сейчас она, наверное, учиться в каком-нибудь престижном универе"
    
    hide gg
    "Из деревни почти не доносилось звуков, за исключением еле слышимых ударов топора и периодическое мычание коров."

    "Зной. На улице никого не было видно."

    ## Тоже картинку сделайте какую-нить

    "Поравнявшись с первыми домами Матвей невольно остановился, засмотревшись на знакомые пейзажи: первый дом явно представлял из себя неплохое хозяйство - об этом свидетельствовала аккуратно скошенная трава перед домом, гуси и коза, стоявшая на привязи к столбу, да чуть ржавый трактор"
    "Картину удручали только выцвевшие покосившиеся ворота. "
    "Дом выглядел жилым, что нельзя сказать о соседних: покосившихся от времени, крыши которых давно провалились вовнутрь, а сады выглядели как одичавшие виноградники"

    ## Картинка развилки

    scene black_bg
    show gg
    gg "И куда же тут идти то… Надо подумать."
    
    
label choise1_loop:
    menu:
        "Озеро":
            jump lake
        "Школа":
            jump school
        "Рыбацкая беседка":
            jump fishing
        "Колхоз":
            jump farm
        "Детская площадка":
            jump playground
            
label lake:
    gg "Так… В той стороне вроде было озеро. Там сейчас наверное прохладно, схожу для начала туда."
    scene forest_trail
    hide gg
    "Летние лучи прорывались сквозь изумрудный лес, освещая тропу к озеру."
    "Чуть поодаль, среди деревьев виднелся старый домик местного лесничего. Покрытый мхом, с разбитым окном."
    show gg
    gg "Странно. Когда я уезжал новый лесник только поселился в этой избе."
    gg "Надо будет потом проверить что там случилось."
    gg "Но сначала к озеру…"
    scene lake
    gg "Неплохой вид. Всяко лучше грёбанной Казани с ее мелкими улочками."
    gg "Нда, вроде и глушь, но свои плюсы имеются."
    hide gg
    "На неровную от ветром поднятых волн поверхность голубого озера изредка опускались хищные птицы в попытках поймать добычу."
    "Другой берег выглядел неухоженным. То и неудивительно, с той стороны нет других деревень."
    "Солнце отражалось в воде и с удвоенной силой ослепляло, приятный для любых глаз вид."
    "Местная фауна тоже жила своей жизнью, звуки стрёкота насекомых раздавались эхом в голове, отчего казалось что они шумят не где-то в лесу, а в голове."
    scene lake_fire
    show gg
    gg " Видимо озеро пользуется популярностью у местных, кто-то из молодёжи кострище сделал."
    gg "Ладно, надо топать в другое место."
    hide gg
    jump choise1_loop
label school:
    hide gg
    scene school
    "Местная школа выделялась только тем, что была старше чем вся деревня."
    "Лишь в двух окнах горел свет, видимо это были те редкие её обитатели, учителя и директор, которые пили чай, вместо уроков, за неимением в ней учеников."
    show gg
    gg "Унылое местечко, здесь я рос, здесь научился курить, здесь же впервые узнал про понятия."
    gg "Учителя тоже те еще забулдыги, трудовик, помнится, трезвым вообще не появлялся."
    gg "И вот как я должен был вырасти пай-мальчиком в этом дерьме?"
    gg "Не буду здесь задерживаться, от одного вида тошнит."
    hide gg
    jump choise1_loop
label fishing:
    scene fishing_camp
    "Дорога к местной речке ничем не выделялась, в отличие от нее самой."
    "Сама по себе река не была сильно широкой, однако тянулась через всю длину деревни и уходила вдаль. Здесь излюбленная рыбацкая зона."
    "Чуть левее сидел рыбак, судя по надутой сумке - явно не местный."
    show gg at left
    gg "Здаров, мужик. Есть клёв?"
    show fm at right
    fm "В последнее время людей все меньше и меньше"
    fm "А оно, как грится, меньше народу - больше клёву."
    gg "Остроумно. Какие новости в деревне?"
    fm "Я сам не местный, точно не знаю. Но если подумать…"
    fm "Да как у всех других думаю, молодняк весь разъехался кто куда."
    fm "Старики-мразматики  про бесовщину всякую говорят. Чёрт его знает что там у них, сам проверь если хочешь."
    gg "Понятно что ничего непонятно. Бывай, мужик."
    hide gg
    hide fm
    jump choise1_loop
label farm:
    scene farm
    "Чуть дальше входа в деревню виднелся местный колхоз, давно никем не пользуемый. Туда даже юноши не бегали хулиганить видимо, не было видно никаких тропок."
    show gg
    gg "Ну нет, через заросли я не потопаю, да и вряд ли там что-то интересное будет."
    hide gg
    jump choise1_loop
label playground:
    scene playground
    "Обычная детская площадка: турник, ржавая, еле крутящаяся карусель, да песочница с минимальным количеством песка."
    "В паре метров от основной площадки вход на корт"
    "Впрочем от корта там 2 рукодельные воротины, затерявшиеся в высоченной траве, да выцветший забор."
    show gg
    gg "Помнится мы с местными пацанами здесь часто собирались, турник…"
    gg "Раньше мы его использовали только чтоб ковры выбивать, а если я…"
    hide gg
    "*подходит к турнику, запрыгивает и делает пару подтягиваний*"
    show gg
    gg "фух, мда, спорт явно не моё."
    scene house_outside
    gg "А вот и дом старика. Да, давно я тут не был"
    gg "Сирень, которую мы сажали с бабкой-то совсем выросла"
    gg "Приехал бы на месяц раньше, может застал как она цветёт"
    gg "Учитывая как она выросла, аромат стоял бы на всю округу и весь двор"
    hide gg
    "Сам дом едва ли изменился за те 4 года"
    "Учитывая, что всё хозяйство держалось в руках Захара Ивановича - крепких, но уже ослабевающих, можно было простить и просевшие ворота, и местами облезлую краску на деревянном заборе"
    "Так или иначе дом выглядел гораздо лучше многих в этой деревне"
    "Только две вещи заметно бросались в глаза:"
    "После большого города он стал казаться приземистее и скромнеее что ли"
    "А ещё любимый бабушкин сад перед домом казался преступно заброшенным…"
    show gg
    gg "Так, ладно. Дед должен быть дома, ну-ка"
    "делает 3 попытки постучать в дверь, никто не открывает"
    gg "Вот старый же, куда запропастился только?"
    gg "Ладно, обойду дом, может чего полезного найду"
    hide gg
    "входит в сад"
    scene garden
    "Первое впечатление о саде оказалось всё-таки немного ошибочным - он не был заброшен абсолютно"
    "Да, он не был настолько прилежно ухожен как раньше, но было видно, как кто-то продолжал за ним ухаживать"
    "Делал он это явно без чувства вкуса или какой-то самоотдачей, а скорее по инерции, но любовь, приложенная к делу всё-таки чувствовалась"
    show gg
    gg "После того как бабка померла, сад представляет собой лишь тень прошлой красоты"
    gg "Не то чтобы он раньше был прям произведением искусствa"
    gg "Но сейчас тем более"
    "*поворачивается и видит песочницу*"
    gg "а вот тут я любил играть…"
    gg "когда-то давно дед с отцом наметили какую-то стройку или ремонт, закупили песка и высыпали прямо здесь"
    gg "таким образом я и получил эту импровизированную песочницу"
    hide gg
    "как можно понять по оставшемуся песку - закончили они едва ли"
    show gg
    gg "Так, и где там все-таки дед?"
    scene behind_house
    "*заходит за дом где огород*"
    hide gg
    "За домом открылся вид на большое поле принадлежавшее хозяину дома. Половина была не засажено, а просто напросто заросшее"
    "На лавке, около стен бани, сидел дед и что-то ножом вырезал из дерева"
    "заслышав незаметно подкравшегося внука, он не успел было обрадоваться (слишком увлечен был делом), однако быстро опомнился и выжидающе, с удивлением и легкой радостью уставился на Матвея"
    show gg
    gg "Ну привет, дед."
    gg "Ты, смотрю, живой еще."
    hide gg
    "и тут волна разочарования и непонимания прокатилась в Захаре Ивановиче"
    "что-то было не то в любимом внуке"
    "с первого взгляда на него были заметны изменения"
    "только деду было непонятно какие именно они были и чем вызваны"
    hide gg
    show gg at left
    show ded at right
    ded "*цок* здравствуй, матвейка"
    ded "а маленький такой добрый, вежливый был. Проходи уж"
    gg "И без твоего разрешения прошел уже"
    gg "Я тут у тебя временно перекантуюсь, отдохну так сказать, в этой дыре Так что  я мешать не буду и ты не мешай, дальше своими делами старческими занимайся"
    ded "А я то уж думал, навестить пришел на старости лет, эх ты."
    ded "Ну проходи, комната сам знаешь где"
    gg "ага, не забыл уж"
    hide ded
    hide gg
    "*заходит в дом*"
    
