

# Определение персонажей игры.
define ded = Character('Дед Захар', color="#c8ffc8")
define gg = Character("Матвей", color="#c8ffc8")

image bg bus_window_factory = "bus_window_factory.png"
image bg bus_window_village = "bus_window_village.png"
image bg bus_inside = "bus_inside.png"
image bg bus_stop = "bus_stop.png"
image bg black_bg = "black_bg.png"

# Вместо использования оператора image можете просто
# складывать все ваши файлы изображений в папку images.
# Например, сцену bg room можно вызвать файлом "bg room.png",
# а eileen happy — "eileen happy.webp", и тогда они появятся в игре.

# Игра начинается здесь:
label start:

    scene bus_window_factory 

    "В окне показались трубы заводов - угрюмая, привычная реальность подоплёкой несостоявшейся молодежи и сотен коммерсантов"

    gg "за час уже добрался до промзоны - совсем скоро я наконец покину Казань - город, в котором я пытался начать лучшую жизнь …"

    scene bus_inside

    gg "Надеюсь меня никто не заметил"

    "Наконец покинув город, Матвей смог расслабиться и незаметно для себя задремал"

    scene black_bg

    ## Звук удара еблом


    gg "Ай! Какого…"


    scene bus_inside

    gg "Точно, я же уехал с города… Главное отсидеться и начну новую жизнь"
    
    "За окном начали мелькать деревья загараживающие солнце, которые то и дело слепили из-за листвы. Качество дороги снижалось по мере продвижения к месту назначения…"    

    gg "Надеюсь Ринат не догадается что это я украл деньги. Подозрительно конечно, что я заранее предупредил о том что уеду в другой город, но у них были большие надежды на меня, не скоро просекут фишку…"


    scene bus_window_village
    

    "За горизонтом виднеется поворот, пункт назначения близится"


    gg "Опять со стариком ютится, от одной мысли об этом угрюмом хрыче тошно. Если б не отец… Сейчас бы жил как все."
    

    ## Звук торможения автобуса

    scene black_bg

    # Звуки шагов и уезжающего автобуса

    gg "ну здравствуй, Епштейновка"

 
    scene bus_stop
 
    # Крутая музыка на фоне из 2006


    "Матвей слегка потянулся, когда автобус стало совсем не видно за горизонтом поднял свою сумку с земли и пошёл по с детства знакомой дороге."
    "Солнечный свет слепил глаза, на улице было жарко и душно из-за влаги, приносимой легким ветром с местной маленькой речушки по мере того, как он спускался вниз - к деревне"

    ## Картинку с дубом вставьте

    gg " Аня… Да, местные мальчишки любили над нами подшучивать, сейчас она, наверное, учиться в каком-нибудь престижном универе"

    "Из деревни почти не доносилось звуков, за исключением еле слышимых ударов топора и периодическое мычание коров."

    "Зной. На улице никого не было видно."

    ## Тоже картинку сделайте какую-нить

    "Поравнявшись с первыми домами Матвей невольно остановился, засмотревшись на знакомые пейзажи: первый дом явно представлял из себя неплохое хозяйство - об этом свидетельствовала аккуратно скошенная трава перед домом, гуси и коза, стоявшая на привязи к столбу, да чуть ржавый трактор"
    "Картину удручали только выцвевшие покосившиеся ворота. "
    "Дом выглядел жилым, что нельзя сказать о соседних: покосившихся от времени, крыши которых давно провалились вовнутрь, а сады выглядели как одичавшие виноградники"

    ## Картинка развилки

    scene black_bg
    gg "И куда же тут идти то… Надо подумать."
    

    return
